Tests/Langley/Beta2p0-medium/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(inlet).*"
    {
        type            uniformFixedValue;
        uniformValue    constant (512.3 0 0);
        value           uniform ( 0 0 0 );
    }

    "(outlet).*"
    {
        type            zeroGradient;
    }
    
    ".*(walls).*"
    {
        type            noSlip;//fixedValue;
        value		uniform (0 0 0);
    }
    
    #include "constr.include"
}

// ************************************************************************* //



